many2one = {'丘脑水平横切面': '颅脑部分切面', '侧脑室水平横切面': '颅脑部分切面', '小脑水平横切面': '颅脑部分切面',
            '颅脑部分切面': '颅脑部分切面',

            '四腔心切面': '心脏部分切面', '左室流出道切面': '心脏部分切面', '右室流出道切面': '心脏部分切面', '三血管气管切面': '心脏部分切面',
            '心脏部分切面': '心脏部分切面',

            '肱骨长轴切面': '股骨肱骨切面', '尺桡骨冠状切面': '股骨肱骨切面', '股骨长轴切面': '股骨肱骨切面', '胫腓骨冠状切面': '股骨肱骨切面',
            '股骨肱骨切面': '股骨肱骨切面',

            '颈胸段脊柱矢状切面': '脊柱部分切面', '腰骶尾段脊柱矢状切面': '脊柱部分切面',
            '脊柱部分切面': '脊柱部分切面',

            '左侧膈肌矢状切面': '膈肌切面', '右侧膈肌矢状切面': '膈肌切面', '膈肌冠状切面': '膈肌切面',
            '膈肌切面': '膈肌切面',

            '其它': '其它', '其他': '其它',
            '双眼球水平横切面': '双眼球水平横切面', '双眼水平横切面': '双眼球水平横切面',

            '鼻唇冠状切面': '鼻唇冠状切面',
            '颜面部正中矢状切面': '颜面部正中矢状切面',
            '上腹部水平横切面': '上腹部水平横切面',
            '脐带腹壁入口处横切面': '脐带腹壁入口处横切面',
            '膀胱水平横切面彩色多普勒': '膀胱水平横切面彩色多普勒',
            '双肾横切面': '双肾横切面',
            '宫颈内口矢状切面': '宫颈内口矢状切面',
            }

# class2id = {'上腹部水平横切面': 0, '双眼球水平横切面': 1, '双肾横切面': 2, '宫颈内口矢状切面': 3, '心脏部分切面': 4, '股骨肱骨切面': 5,
#             '脊柱部分切面': 6, '脐带腹壁入口处横切面': 7, '膀胱水平横切面彩色多普勒': 8, '膈肌切面': 9, '颅脑部分切面': 10,
#             '颜面部正中矢状切面': 11, '鼻唇冠状切面': 12}
class2id = {'上腹部水平横切面': 0, '其它': 1, '双眼球水平横切面': 2, '双肾横切面': 3, '宫颈内口矢状切面': 4, '心脏部分切面': 5,
            '股骨肱骨切面': 6, '脊柱部分切面': 7, '脐带腹壁入口处横切面': 8, '膀胱水平横切面彩色多普勒': 9, '膈肌切面': 10,
            '颅脑部分切面': 11, '颜面部正中矢状切面': 12, '鼻唇冠状切面': 13}
classes = list(class2id.keys())
need_sub_data = ['丘脑水平横切面', '侧脑室水平横切面', '小脑水平横切面',
                 '四腔心切面', '左室流出道切面', '右室流出道切面', '三血管气管切面',
                 '肱骨长轴切面', '尺桡骨冠状切面', '股骨长轴切面', '胫腓骨冠状切面',
                 '颈胸段脊柱矢状切面', '腰骶尾段脊柱矢状切面',
                 '左侧膈肌矢状切面', '右侧膈肌矢状切面', '膈肌冠状切面']
IMG_FORMATS = ('bmp', 'jpg', 'jpeg', 'png', 'tif', 'tiff', 'dng', 'webp', 'mpo')
